package weather

//Cities lat and lon
type LatLon struct{
	Lat float64
	Lon float64
}

func GetCities() map[string]LatLon{
	return map[string]LatLon{
		"آذرشهر": {
			Lat: 37.758889,
			Lon: 45.978333,
		},
		"اسکو": {
			Lat: 37.915833,
			Lon: 46.123611,
		},
		"اهر": {
			Lat: 38.4894305,
			Lon: 47.0683575,
		},
		"بستان آباد": {
			Lat: 37.85,
			Lon: 46.833333,
		},
		"بناب": {
			Lat: 37.340278,
			Lon: 46.056111,
		},
		"تبریز": {
			Lat: 38.066667,
			Lon: 46.3,
		},
		"جلفا": {
			Lat: 38.940278,
			Lon: 45.630833,
		},
		"چار اویماق": {
			Lat: 37.1299052,
			Lon: 47.0245686,
		},
		"سراب": {
			Lat: 37.940833,
			Lon: 47.536667,
		},
		"شبستر": {
			Lat: 38.180278,
			Lon: 45.702778,
		},
		"عجبشیر": {
			Lat: 37.4775,
			Lon: 45.894167,
		},
		"کلیبر": {
			Lat: 38.869444,
			Lon: 47.035556,
		},
		"مراغه": {
			Lat: 37.389167,
			Lon: 46.2375,
		},
		"مرند": {
			Lat: 38.425117,
			Lon: 45.769636,
		},
		"ملکان": {
			Lat: 37.145625,
			Lon: 46.1685242,
		},
		"میانه": {
			Lat: 37.421111,
			Lon: 47.715,
		},
		"ورزقان": {
			Lat: 38.509722,
			Lon: 46.654444,
		},
		"هریس": {
			Lat: 29.7751825,
			Lon: -95.3102505,
		},
		"هشترود": {
			Lat: 37.477778,
			Lon: 47.050833,
		},
		"ارومیه": {
			Lat: 37.555278,
			Lon: 45.0725,
		},
		"اشنویه": {
			Lat: 37.039722,
			Lon: 45.098333,
		},
		"بوکان": {
			Lat: 36.521111,
			Lon: 46.208889,
		},
		"پیرانشهر": {
			Lat: 36.694444,
			Lon: 45.141667,
		},
		"تکاب": {
			Lat: 36.400833,
			Lon: 47.113333,
		},
		"چالدران": {
			Lat: 39.0649837,
			Lon: 44.3844679,
		},
		"خوی": {
			Lat: 38.550278,
			Lon: 44.952222,
		},
		"سردشت": {
			Lat: 36.155278,
			Lon: 45.478889,
		},
		"سلماس": {
			Lat: 38.197222,
			Lon: 44.765278,
		},
		"شاهین دژ": {
			Lat: 36.679167,
			Lon: 46.566944,
		},
		"ماکو": {
			Lat: 39.295278,
			Lon: 44.516667,
		},
		"مهاباد": {
			Lat: 36.763056,
			Lon: 45.722222,
		},
		"میاندوآب": {
			Lat: 36.969444,
			Lon: 46.102778,
		},
		"نقده": {
			Lat: 36.955278,
			Lon: 45.388056,
		},
		"اردبیل": {
			Lat: 38.4853276,
			Lon: 47.8911209,
		},
		"بیله سوار": {
			Lat: 39.3567775,
			Lon: 47.9490765,
		},
		"پارس آباد": {
			Lat: 39.648333,
			Lon: 47.9175,
		},
		"خلخال": {
			Lat: 37.618889,
			Lon: 48.525833,
		},
		"کوثر": {
			Lat: 31.8676866,
			Lon: 54.3379802,
		},
		"گرمی": {
			Lat: 39.0372267,
			Lon: 47.9277021,
		},
		"مشگین": {
			Lat: 38.398889,
			Lon: 47.681944,
		},
		"نمین": {
			Lat: 38.426944,
			Lon: 48.483889,
		},
		"نیر": {
			Lat: 38.034722,
			Lon: 47.998611,
		},
		"آران و بیدگل": {
			Lat: 34.057778,
			Lon: 51.484167,
		},
		"اردستان": {
			Lat: 33.376111,
			Lon: 52.369444,
		},
		"اصفهان": {
			Lat: 32.6546275,
			Lon: 51.6679826,
		},
		"برخوار و میمه": {
			Lat: 32.833333,
			Lon: 51.775,
		},
		"چادگان": {
			Lat: 32.768333,
			Lon: 50.628611,
		},
		"خمینی شهر": {
			Lat: 32.700278,
			Lon: 51.521111,
		},
		"خوانسار": {
			Lat: 33.220556,
			Lon: 50.315,
		},
		"سمیرم": {
			Lat: 31.3988346,
			Lon: 51.567593,
		},
		"شاهین شهر و میمه": {
			Lat: 33.1271852,
			Lon: 51.5150077,
		},
		"شهر رضا": {
			Lat: 36.2924452,
			Lon: 59.5677149,
		},
		"دهاقان": {
			Lat: 31.94,
			Lon: 51.647778,
		},
		"فریدن": {
			Lat: 33.0214829,
			Lon: 50.3069088,
		},
		"فریدون شهر": {
			Lat: 32.941111,
			Lon: 50.121111,
		},
		"فلاورجان": {
			Lat: 32.555278,
			Lon: 51.509722,
		},
		"کاشان": {
			Lat: 33.9850358,
			Lon: 51.4099625,
		},
		"گلپایگان": {
			Lat: 33.453611,
			Lon: 50.288333,
		},
		"لنجان": {
			Lat: 32.4750168,
			Lon: 51.3050851,
		},
		"مبارکه": {
			Lat: 32.346389,
			Lon: 51.504444,
		},
		"نائین": {
			Lat: 32.8599445,
			Lon: 53.0878321,
		},
		"نجف آباد": {
			Lat: 32.6324231,
			Lon: 51.3679914,
		},
		"نطنز": {
			Lat: 33.513333,
			Lon: 51.916389,
		},
		"ساوجبلاق": {
			Lat: 38.3787941,
			Lon: 47.4974359,
		},
		"کرج": {
			Lat: 35.8400188,
			Lon: 50.9390906,
		},
		"نظرآباد": {
			Lat: 35.952222,
			Lon: 50.6075,
		},
		"طالقان": {
			Lat: 33.2729171,
			Lon: 52.1985314,
		},
		"آبدانان": {
			Lat: 32.9925,
			Lon: 47.419722,
		},
		"ایلام": {
			Lat: 33.2957618,
			Lon: 46.670534,
		},
		"ایوان": {
			Lat: 33.827222,
			Lon: 46.309722,
		},
		"دره شهر": {
			Lat: 33.139722,
			Lon: 47.376111,
		},
		"دهلران": {
			Lat: 32.694167,
			Lon: 47.267778,
		},
		"شیران و چرداول": {
			Lat: 33.6938348,
			Lon: 46.7478493,
		},
		"مهران": {
			Lat: 33.122222,
			Lon: 46.164722,
		},
		"بوشهر": {
			Lat: 28.9233837,
			Lon: 50.820314,
		},
		"تنگستان": {
			Lat: 28.9837547,
			Lon: 50.8330708,
		},
		"جم": {
			Lat: 27.827778,
			Lon: 52.326944,
		},
		"دشتستان": {
			Lat: 29.266667,
			Lon: 51.216667,
		},
		"دشتی": {
			Lat: 35.7845145,
			Lon: 51.4347961,
		},
		"دیر": {
			Lat: 27.84,
			Lon: 51.937778,
		},
		"دیلم": {
			Lat: 30.1182632,
			Lon: 50.2261227,
		},
		"کنگان": {
			Lat: 27.8370437,
			Lon: 52.0645473,
		},
		"گناوه": {
			Lat: 29.579167,
			Lon: 50.516944,
		},
		"اسلام شهر": {
			Lat: 35.5445805,
			Lon: 51.2302457,
		},
		"پاکدشت": {
			Lat: 35.4668913,
			Lon: 51.6860625,
		},
		"تهران": {
			Lat: 35.696111,
			Lon: 51.423056,
		},
		"دماوند": {
			Lat: 35.9467494,
			Lon: 52.1275481,
		},
		"رباط کریم": {
			Lat: 35.484722,
			Lon: 51.082778,
		},
		"ری": {
			Lat: 48.3444663,
			Lon: -103.1651845,
		},
		"شمیرانات": {
			Lat: 35.9548021,
			Lon: 51.5991643,
		},
		"شهریار": {
			Lat: 35.659722,
			Lon: 51.059167,
		},
		"فیروزکوه": {
			Lat: 35.438671,
			Lon: 60.809387,
		},
		"ورامین": {
			Lat: 35.3252407,
			Lon: 51.6471987,
		},
		"اردل": {
			Lat: 31.999722,
			Lon: 50.661667,
		},
		"بروجن": {
			Lat: 31.965278,
			Lon: 51.287222,
		},
		"شهرکرد": {
			Lat: 32.325556,
			Lon: 50.864444,
		},
		"فارسان": {
			Lat: 32.2582066,
			Lon: 50.5705088,
		},
		"کوهرنگ": {
			Lat: 32.5558364,
			Lon: 51.6787252,
		},
		"لردگان": {
			Lat: 31.510278,
			Lon: 50.829444,
		},
		"بیرجند": {
			Lat: 32.8649039,
			Lon: 59.2262472,
		},
		"درمیان": {
			Lat: 33.0339405,
			Lon: 60.1184797,
		},
		"سرایان": {
			Lat: 33.860278,
			Lon: 58.521667,
		},
		"سر بیشه": {
			Lat: 32.575556,
			Lon: 59.798333,
		},
		"فردوس": {
			Lat: 34.018611,
			Lon: 58.172222,
		},
		"قائن": {
			Lat: 33.726667,
			Lon: 59.184444,
		},
		"نهبندان": {
			Lat: 31.541944,
			Lon: 60.036389,
		},
		"برد سکن": {
			Lat: 35.260833,
			Lon: 57.969722,
		},
		"بجستان": {
			Lat: 34.516389,
			Lon: 58.184444,
		},
		"تایباد": {
			Lat: 34.74,
			Lon: 60.775556,
		},
		"تربت جام": {
			Lat: 35.243889,
			Lon: 60.6225,
		},
		"تربت حیدریه": {
			Lat: 35.273889,
			Lon: 59.219444,
		},
		"چناران": {
			Lat: 36.645556,
			Lon: 59.121111,
		},
		"جغتای": {
			Lat: 36.5788853,
			Lon: 57.251215,
		},
		"جوین": {
			Lat: 36.6362238,
			Lon: 57.5079912,
		},
		"خلیل آباد": {
			Lat: 35.255833,
			Lon: 58.286389,
		},
		"خواف": {
			Lat: 34.576389,
			Lon: 60.140833,
		},
		"درگز": {
			Lat: 37.444444,
			Lon: 59.108056,
		},
		"رشتخوار": {
			Lat: 34.974722,
			Lon: 59.623611,
		},
		"زاوه": {
			Lat: 35.2747322,
			Lon: 59.4677727,
		},
		"سبزوار": {
			Lat: 36.2151823,
			Lon: 57.6678228,
		},
		"سرخس": {
			Lat: 36.545,
			Lon: 61.157778,
		},
		"فریمان": {
			Lat: 35.706944,
			Lon: 59.85,
		},
		"قوچان": {
			Lat: 37.106111,
			Lon: 58.509444,
		},
		"طرقبه شاندیز": {
			Lat: 36.3548841,
			Lon: 59.4383955,
		},
		"کاشمر": {
			Lat: 35.238333,
			Lon: 58.465556,
		},
		"کلات": {
			Lat: 34.198333,
			Lon: 58.544444,
		},
		"گناباد": {
			Lat: 34.352778,
			Lon: 58.683611,
		},
		"مشهد": {
			Lat: 36.2604623,
			Lon: 59.6167549,
		},
		"مه ولات": {
			Lat: 35.0210829,
			Lon: 58.7818116,
		},
		"نیشابور": {
			Lat: 36.2140865,
			Lon: 58.7960915,
		},
		"اسفراین": {
			Lat: 37.076389,
			Lon: 57.51,
		},
		"بجنورد": {
			Lat: 37.475,
			Lon: 57.333333,
		},
		"جاجرم": {
			Lat: 36.95,
			Lon: 56.38,
		},
		"شیروان": {
			Lat: 37.4092357,
			Lon: 57.9276184,
		},
		"فاروج": {
			Lat: 37.231111,
			Lon: 58.218889,
		},
		"مانه و سملقان": {
			Lat: 37.6620614,
			Lon: 56.741207,
		},
		"آبادان": {
			Lat: 30.347296,
			Lon: 48.2934004,
		},
		"امیدیه": {
			Lat: 30.745833,
			Lon: 49.708611,
		},
		"اندیمشک": {
			Lat: 32.46,
			Lon: 48.359167,
		},
		"اهواز": {
			Lat: 31.3183272,
			Lon: 48.6706187,
		},
		"ایذه": {
			Lat: 31.834167,
			Lon: 49.867222,
		},
		"باغ ملک": {
			Lat: 32.3947206,
			Lon: 51.5965328,
		},
		"بندرماهشهر": {
			Lat: 30.558889,
			Lon: 49.198056,
		},
		"بهبهان": {
			Lat: 30.595833,
			Lon: 50.241667,
		},
		"خرمشهر": {
			Lat: 30.4256219,
			Lon: 48.1891185,
		},
		"دزفول": {
			Lat: 32.3830777,
			Lon: 48.4235841,
		},
		"دشت آزادگان": {
			Lat: 31.558056,
			Lon: 48.180833,
		},
		"رامشیر": {
			Lat: 30.8956521,
			Lon: 49.4094701,
		},
		"رامهرمز": {
			Lat: 31.28,
			Lon: 49.603611,
		},
		"شادگان": {
			Lat: 30.649722,
			Lon: 48.664722,
		},
		"شوش": {
			Lat: 32.194167,
			Lon: 48.243611,
		},
		"شوشتر": {
			Lat: 32.045556,
			Lon: 48.856667,
		},
		"گتوند": {
			Lat: 32.251389,
			Lon: 48.816111,
		},
		"لالی": {
			Lat: 32.328889,
			Lon: 49.093611,
		},
		"مسجد سلیمان": {
			Lat: 31.936389,
			Lon: 49.303889,
		},
		"هندیجان": {
			Lat: 30.236389,
			Lon: 49.711944,
		},
		"ابهر": {
			Lat: 36.146667,
			Lon: 49.218056,
		},
		"ایجرود": {
			Lat: 36.4160928,
			Lon: 48.2469249,
		},
		"خدابنده": {
			Lat: 36.114722,
			Lon: 48.591111,
		},
		"خرمدره": {
			Lat: 36.203056,
			Lon: 49.186944,
		},
		"زنجان": {
			Lat: 36.5018185,
			Lon: 48.3988186,
		},
		"طارم": {
			Lat: 28.1804287,
			Lon: 55.7453367,
		},
		"ماه نشان": {
			Lat: 36.744444,
			Lon: 47.6725,
		},
		"دامغان": {
			Lat: 36.168333,
			Lon: 54.348056,
		},
		"سمنان": {
			Lat: 35.2255585,
			Lon: 54.4342138,
		},
		"شاهرود": {
			Lat: 36.418056,
			Lon: 54.976389,
		},
		"گرمسار": {
			Lat: 35.218333,
			Lon: 52.340833,
		},
		"مهدی شهر": {
			Lat: 35.7,
			Lon: 53.35,
		},
		"ایرانشهر": {
			Lat: 27.2025,
			Lon: 60.684722,
		},
		"چابهار": {
			Lat: 25.291944,
			Lon: 60.643056,
		},
		"خاش": {
			Lat: 28.216667,
			Lon: 61.2,
		},
		"دلگان": {
			Lat: 27.6077357,
			Lon: 59.4720904,
		},
		"زابل": {
			Lat: 31.028611,
			Lon: 61.501111,
		},
		"زاهدان": {
			Lat: 29.496389,
			Lon: 60.862778,
		},
		"زهک": {
			Lat: 30.893889,
			Lon: 61.680278,
		},
		"سراوان": {
			Lat: 27.370833,
			Lon: 62.334167,
		},
		"سرباز": {
			Lat: 26.630833,
			Lon: 61.256389,
		},
		"کنارک": {
			Lat: 25.360278,
			Lon: 60.399444,
		},
		"نیکشهر": {
			Lat: 26.4184719,
			Lon: 60.2110752,
		},
		"آباده": {
			Lat: 31.160833,
			Lon: 52.650556,
		},
		"ارسنجان": {
			Lat: 29.9125,
			Lon: 53.308611,
		},
		"استهبان": {
			Lat: 29.126667,
			Lon: 54.042222,
		},
		"اقلید": {
			Lat: 30.898889,
			Lon: 52.686667,
		},
		"بوانات": {
			Lat: 30.4855907,
			Lon: 53.5933304,
		},
		"پاسارگاد": {
			Lat: 30.2033075,
			Lon: 53.17901,
		},
		"جهرم": {
			Lat: 28.5,
			Lon: 53.560556,
		},
		"خرم بید": {
			Lat: 32.6708345,
			Lon: 51.6470279,
		},
		"خنج": {
			Lat: 27.891389,
			Lon: 53.434444,
		},
		"داراب": {
			Lat: 28.751944,
			Lon: 54.544444,
		},
		"زرین دشت": {
			Lat: 28.3545047,
			Lon: 54.4178006,
		},
		"سپیدان": {
			Lat: 30.2425282,
			Lon: 51.9924185,
		},
		"شیراز": {
			Lat: 29.5917677,
			Lon: 52.5836982,
		},
		"فراشبند": {
			Lat: 28.871389,
			Lon: 52.091667,
		},
		"فسا": {
			Lat: 28.938333,
			Lon: 53.648333,
		},
		"فیروزآباد": {
			Lat: 28.843889,
			Lon: 52.570833,
		},
		"قیر و کارزین": {
			Lat: 28.42998,
			Lon: 53.09516,
		},
		"کازرون": {
			Lat: 29.619444,
			Lon: 51.654167,
		},
		"لارستان": {
			Lat: 27.681111,
			Lon: 54.340278,
		},
		"لامرد": {
			Lat: 27.3423771,
			Lon: 53.1803558,
		},
		"مرودشت": {
			Lat: 29.874167,
			Lon: 52.8025,
		},
		"ممسنی": {
			Lat: 31.9600345,
			Lon: 50.5122652,
		},
		"مهر": {
			Lat: 27.5559931,
			Lon: 52.8847205,
		},
		"نی ریز": {
			Lat: 29.198889,
			Lon: 54.327778,
		},
		"آبیک": {
			Lat: 36.04,
			Lon: 50.531111,
		},
		"البرز": {
			Lat: 35.9960467,
			Lon: 50.9289246,
		},
		"بوئین زهرا": {
			Lat: 35.766944,
			Lon: 50.057778,
		},
		"تاکستان": {
			Lat: 36.069722,
			Lon: 49.695833,
		},
		"قزوین": {
			Lat: 36.0881317,
			Lon: 49.8547266,
		},
		"قم": {
			Lat: 34.6399443,
			Lon: 50.8759419,
		},
		"بانه": {
			Lat: 35.9985999,
			Lon: 45.8823428,
		},
		"بیجار": {
			Lat: 32.735278,
			Lon: 59.466667,
		},
		"دیواندره": {
			Lat: 35.913889,
			Lon: 47.023889,
		},
		"سروآباد": {
			Lat: 35.3125,
			Lon: 46.366944,
		},
		"سقز": {
			Lat: 36.246389,
			Lon: 46.266389,
		},
		"سنندج": {
			Lat: 35.3218748,
			Lon: 46.9861647,
		},
		"قروه": {
			Lat: 35.1678934,
			Lon: 47.8038272,
		},
		"کامیاران": {
			Lat: 34.795556,
			Lon: 46.935556,
		},
		"مریوان": {
			Lat: 35.526944,
			Lon: 46.176389,
		},
		"بافت": {
			Lat: 29.233056,
			Lon: 56.602222,
		},
		"بردسیر": {
			Lat: 29.9275,
			Lon: 56.572222,
		},
		"بم": {
			Lat: 29.106111,
			Lon: 58.356944,
		},
		"جیرفت": {
			Lat: 28.6751124,
			Lon: 57.7371569,
		},
		"راور": {
			Lat: 31.265556,
			Lon: 56.805556,
		},
		"رفسنجان": {
			Lat: 30.406667,
			Lon: 55.993889,
		},
		"رودبار جنوب": {
			Lat: 36.8241289,
			Lon: 49.4237274,
		},
		"زرند": {
			Lat: 30.812778,
			Lon: 56.563889,
		},
		"سیرجان": {
			Lat: 29.4586676,
			Lon: 55.6714051,
		},
		"شهر بابک": {
			Lat: 30.116389,
			Lon: 55.118611,
		},
		"عنبرآباد": {
			Lat: 28.4783333,
			Lon: 57.8413889,
		},
		"قلعه گنج": {
			Lat: 27.523611,
			Lon: 57.881111,
		},
		"کرمان": {
			Lat: 29.4850089,
			Lon: 57.6439048,
		},
		"کوهبنان": {
			Lat: 31.410278,
			Lon: 56.2825,
		},
		"کهنوج": {
			Lat: 27.9467603,
			Lon: 57.7062572,
		},
		"منوجان": {
			Lat: 27.4475626,
			Lon: 57.5051616,
		},
		"اسلام آباد غرب": {
			Lat: 33.7293882,
			Lon: 73.0931461,
		},
		"پاوه": {
			Lat: 35.043333,
			Lon: 46.356389,
		},
		"ثلاث باباجانی": {
			Lat: 34.7358371,
			Lon: 46.1493969,
		},
		"جوانرود": {
			Lat: 34.806667,
			Lon: 46.488611,
		},
		"دالاهو": {
			Lat: 34.284167,
			Lon: 46.242222,
		},
		"روانسر": {
			Lat: 34.7120892,
			Lon: 46.6512998,
		},
		"سرپل ذهاب": {
			Lat: 34.461111,
			Lon: 45.862778,
		},
		"سنقر": {
			Lat: 34.783611,
			Lon: 47.600278,
		},
		"صحنه": {
			Lat: 34.481389,
			Lon: 47.690833,
		},
		"قصر شیرین": {
			Lat: 34.5159031,
			Lon: 45.5776859,
		},
		"کرمانشاه": {
			Lat: 34.4576233,
			Lon: 46.670534,
		},
		"کنگاور": {
			Lat: 34.504167,
			Lon: 47.965278,
		},
		"گیلان غرب": {
			Lat: 34.142222,
			Lon: 45.920278,
		},
		"هرسین": {
			Lat: 34.2719149,
			Lon: 47.6046183,
		},
		"بویر احمد": {
			Lat: 30.724586,
			Lon: 50.8456323,
		},
		"دنا": {
			Lat: 30.9516666,
			Lon: 51.4375,
		},
		"گچساران": {
			Lat: 30.35,
			Lon: 50.8,
		},
		"آزادشهر": {
			Lat: 37.086944,
			Lon: 55.173889,
		},
		"آق قلا": {
			Lat: 37.013889,
			Lon: 54.455,
		},
		"بندر گز": {
			Lat: 36.774965,
			Lon: 53.9461749,
		},
		"بندر ترکمن": {
			Lat: 36.901667,
			Lon: 54.070833,
		},
		"رامیان": {
			Lat: 37.016111,
			Lon: 55.141111,
		},
		"علی آباد": {
			Lat: 36.308226,
			Lon: 74.6195474,
		},
		"کرد کوی": {
			Lat: 36.7941426,
			Lon: 54.110274,
		},
		"کلاله": {
			Lat: 37.380833,
			Lon: 55.491667,
		},
		"گرگان": {
			Lat: 36.8456427,
			Lon: 54.4393363,
		},
		"گنبد کاووس": {
			Lat: 37.25,
			Lon: 55.167222,
		},
		"مینو دشت": {
			Lat: 37.228889,
			Lon: 55.374722,
		},
		"آستارا": {
			Lat: 38.429167,
			Lon: 48.871944,
		},
		"آستانه اشرفیه": {
			Lat: 37.2598022,
			Lon: 49.9436621,
		},
		"املش": {
			Lat: 37.0916334,
			Lon: 50.1869377,
		},
		"بندر انزلی": {
			Lat: 37.4724467,
			Lon: 49.4587312,
		},
		"رشت": {
			Lat: 37.280833,
			Lon: 49.583056,
		},
		"رضوانشهر": {
			Lat: 37.550675,
			Lon: 49.1409801,
		},
		"رودبار": {
			Lat: 36.8241289,
			Lon: 49.4237274,
		},
		"رودسر": {
			Lat: 37.1378415,
			Lon: 50.2836199,
		},
		"سیاهکل": {
			Lat: 37.152778,
			Lon: 49.870833,
		},
		"شفت": {
			Lat: 39.630631,
			Lon: -78.929542,
		},
		"صومعه سرا": {
			Lat: 37.311667,
			Lon: 49.321944,
		},
		"طوالش": {
			Lat: 37.0,
			Lon: 48.4222222,
		},
		"فومن": {
			Lat: 37.223889,
			Lon: 49.3125,
		},
		"لاهیجان": {
			Lat: 37.207222,
			Lon: 50.003889,
		},
		"لنگرود": {
			Lat: 37.196944,
			Lon: 50.153611,
		},
		"ماسال": {
			Lat: 37.3621185,
			Lon: 49.1314769,
		},
		"ازنا": {
			Lat: 33.455833,
			Lon: 49.455556,
		},
		"الیگودرز": {
			Lat: 33.400556,
			Lon: 49.695,
		},
		"بروجرد": {
			Lat: 33.8941993,
			Lon: 48.767033,
		},
		"پلدختر": {
			Lat: 33.153611,
			Lon: 47.713611,
		},
		"خرم آباد": {
			Lat: 33.487778,
			Lon: 48.355833,
		},
		"دورود": {
			Lat: 33.4955028,
			Lon: 49.0631743,
		},
		"دلفان": {
			Lat: 33.5034014,
			Lon: 48.3575836,
		},
		"سلسله": {
			Lat: 32.045776,
			Lon: 34.751639,
		},
		"کوهدشت": {
			Lat: 33.535,
			Lon: 47.606111,
		},
		"الشتر": {
			Lat: 33.8639888,
			Lon: 48.2642387,
		},
		"نورآباد": {
			Lat: 30.114167,
			Lon: 51.521667,
		},
		"آمل": {
			Lat: 36.469722,
			Lon: 52.350833,
		},
		"بابل": {
			Lat: 32.468191,
			Lon: 44.5501935,
		},
		"بابلسر": {
			Lat: 36.7025,
			Lon: 52.6575,
		},
		"بهشهر": {
			Lat: 36.692222,
			Lon: 53.5525,
		},
		"تنکابن": {
			Lat: 36.816389,
			Lon: 50.873889,
		},
		"جویبار": {
			Lat: 36.641111,
			Lon: 52.9125,
		},
		"چالوس": {
			Lat: 36.6459174,
			Lon: 51.406979,
		},
		"رامسر": {
			Lat: 36.903056,
			Lon: 50.658333,
		},
		"ساری": {
			Lat: 36.563333,
			Lon: 53.06,
		},
		"سوادکوه": {
			Lat: 36.3040255,
			Lon: 52.8852403,
		},
		"قائم شهر": {
			Lat: 36.463056,
			Lon: 52.86,
		},
		"گلوگاه": {
			Lat: 36.727222,
			Lon: 53.808889,
		},
		"محمود آباد": {
			Lat: 36.631944,
			Lon: 52.262778,
		},
		"نکا": {
			Lat: 36.650833,
			Lon: 53.299167,
		},
		"نور": {
			Lat: 50.3851246,
			Lon: 3.2642436,
		},
		"نوشهر": {
			Lat: 36.648889,
			Lon: 51.496111,
		},
		"فریدونکنار": {
			Lat: 36.686389,
			Lon: 52.5225,
		},
		"آشتیان": {
			Lat: 34.521944,
			Lon: 50.006111,
		},
		"اراک": {
			Lat: 34.091667,
			Lon: 49.689167,
		},
		"تفرش": {
			Lat: 34.691944,
			Lon: 50.013056,
		},
		"خمین": {
			Lat: 33.6406148,
			Lon: 50.0771125,
		},
		"دلیجان": {
			Lat: 33.990556,
			Lon: 50.683889,
		},
		"زرندیه": {
			Lat: 35.3069962,
			Lon: 50.4911792,
		},
		"ساوه": {
			Lat: 35.021389,
			Lon: 50.356667,
		},
		"شازند": {
			Lat: 33.9275,
			Lon: 49.411667,
		},
		"کمیجان": {
			Lat: 34.719167,
			Lon: 49.326667,
		},
		"محلات": {
			Lat: 33.9085748,
			Lon: 50.4552616,
		},
		"بندرعباس": {
			Lat: 27.1832216,
			Lon: 56.2666455,
		},
		"میناب": {
			Lat: 27.146667,
			Lon: 57.08,
		},
		"بندر لنگه": {
			Lat: 26.558056,
			Lon: 54.880556,
		},
		"رودان-دهبارز": {
			Lat: 27.440833,
			Lon: 57.1925,
		},
		"جاسک": {
			Lat: 25.643889,
			Lon: 57.774444,
		},
		"قشم": {
			Lat: 26.8118673,
			Lon: 55.8913207,
		},
		"حاجی آباد": {
			Lat: 28.309167,
			Lon: 55.901667,
		},
		"ابوموسی": {
			Lat: 25.8797106,
			Lon: 55.0328017,
		},
		"بستک": {
			Lat: 27.199167,
			Lon: 54.366667,
		},
		"گاوبندی": {
			Lat: 27.208333,
			Lon: 53.036111,
		},
		"خمیر": {
			Lat: 26.952222,
			Lon: 55.585,
		},
		"اسدآباد": {
			Lat: 34.7825,
			Lon: 48.118611,
		},
		"بهار": {
			Lat: 34.9083252,
			Lon: 48.4392729,
		},
		"تویسرکان": {
			Lat: 34.548056,
			Lon: 48.446944,
		},
		"رزن": {
			Lat: 35.386667,
			Lon: 49.033889,
		},
		"کبودر آهنگ": {
			Lat: 35.208333,
			Lon: 48.723889,
		},
		"ملایر": {
			Lat: 34.296944,
			Lon: 48.823611,
		},
		"نهاوند": {
			Lat: 34.188611,
			Lon: 48.376944,
		},
		"همدان": {
			Lat: 34.7607999,
			Lon: 48.3988186,
		},
		"ابرکوه": {
			Lat: 31.1304036,
			Lon: 53.2503736,
		},
		"اردکان": {
			Lat: 32.31,
			Lon: 54.0175,
		},
		"بافق": {
			Lat: 31.612778,
			Lon: 55.410556,
		},
		"تفت": {
			Lat: 27.9789074,
			Lon: -97.3986041,
		},
		"خاتم": {
			Lat: 37.2709152,
			Lon: 49.5969146,
		},
		"صدوق": {
			Lat: 32.0242162,
			Lon: 53.4770359,
		},
		"طبس": {
			Lat: 33.595833,
			Lon: 56.924444,
		},
		"مهریز": {
			Lat: 31.591667,
			Lon: 54.431667,
		},
		"میبد": {
			Lat: 32.2487226,
			Lon: 54.0079341,
		},
		"یزد": {
			Lat: 32.1006387,
			Lon: 54.4342138,
		},
	}
}

